# Analisis de datos

## Restaurante

### Ejercicio 1:

Importamos pandas para poder trabajar con analisis de datos:

In [1]:
import pandas as pd

Importamos el archivo "restaurante.xlsx", contiene la base de datos del restaurante:

In [2]:
restaurante=pd.read_excel("../restaurante.xlsx")
restaurante.head()

,Orden,Fecha,Hora de Cobro,Mesa,Atendió,Tipo,Producto,Categoria,Precio,Costo,Propina,Tipo de Cliente
0,1,2014-02-01,18:43:12,1,Rodolfo,Bebida,Tecate,Cervezas,25,18.00,0.07,Cliente Nuevo
1,1,2014-02-01,18:43:12,1,Rodolfo,Bebida,Tisana,Bebida no Alcohol,25,18.00,0.07,Cliente Nuevo
2,1,2014-02-01,18:43:12,1,Rodolfo,Bebida,Café americano,Bebida no Alcohol,18,12.60,0.07,Cliente Nuevo
3,1,2014-02-01,18:43:12,1,Rodolfo,Bebida,Te helado,Bebida no Alcohol,25,18.50,0.07,Cliente Nuevo
4,1,2014-02-01,18:43:12,1,Rodolfo,Comida,Pera Rostizada,Ensaladas,89,75.65,0.07,Cliente Nuevo

Agregar una columna llamada "FechaMes", que contenga el año y el mes de la columna fecha (Ej. 2010-03)

In [3]:
restaurante["FechaMes"]=restaurante.Fecha.dt.strftime("%Y-%m")
restaurante.head()

,Orden,Fecha,Hora de Cobro,Mesa,Atendió,Tipo,Producto,Categoria,Precio,Costo,Propina,Tipo de Cliente,FechaMes
0,1,2014-02-01,18:43:12,1,Rodolfo,Bebida,Tecate,Cervezas,25,18.00,0.07,Cliente Nuevo,2014-02
1,1,2014-02-01,18:43:12,1,Rodolfo,Bebida,Tisana,Bebida no Alcohol,25,18.00,0.07,Cliente Nuevo,2014-02
2,1,2014-02-01,18:43:12,1,Rodolfo,Bebida,Café americano,Bebida no Alcohol,18,12.60,0.07,Cliente Nuevo,2014-02
3,1,2014-02-01,18:43:12,1,Rodolfo,Bebida,Te helado,Bebida no Alcohol,25,18.50,0.07,Cliente Nuevo,2014-02
4,1,2014-02-01,18:43:12,1,Rodolfo,Comida,Pera Rostizada,Ensaladas,89,75.65,0.07,Cliente Nuevo,2014-02

Investigaremos si el ingreso ha bajado, obteneniendo las ventas totales de cada mes:

In [4]:
restaurante.groupby("FechaMes").agg({"Precio":"sum"})

          Precio
FechaMes
2014-02   158871
2014-03   199750
2014-04   205472
2014-05   160516
2014-06   190253
2014-07   182819
2014-08   176184
2014-09   155277
2014-10   166222
2014-11   151881
2014-12   161006
2015-01   143378

Harémos una inspección rápida de los datos con una gráfica de calor sobre las ventas de cada mes:

![Resuelto](../Img_Proyecto_Final/Act1Img1.png)

Hacemos una gráfica de barras con las ventas de cada mes:

![Resuelto](../Img_Proyecto_Final/Act1Img2.png)

__Conclusión:__ los ingresos aumentaron al principio, pero volvieron a bajar a niveles record.

### Ejercicio 2:

Ahora contaremos cuantos productos se sirvieron en cada mes:

In [5]:
restaurante.groupby("FechaMes").size()

FechaMes
2014-02    2427
2014-03    2879
2014-04    2692
2014-05    2244
2014-06    2580
2014-07    2488
2014-08    2399
2014-09    2467
2014-10    2519
2014-11    2489
2014-12    2591
2015-01    2357
dtype: int64

Crearemos un gráfico de calor sobre la cantidad de platos vendidos en cada mes para hacer un análisis exploratorio sencillo:

![Resuelto](../Img_Proyecto_Final/Act2Img1.png)

Haremos una gráfica de linea con el total de productos servidos por mes:

![Resuelto](../Img_Proyecto_Final/Act2Img2.png)

__Conclusión:__ los ingresos bajaron, pero la cantidad de productos vendidos se mantuvo en el tiempo

### Ejercicio 3:

Ahora mostraremos los ingresos al mes según si es comida o bebida, para encontrar si hubo un cambio en los habitos de consumo de los clientes:

In [6]:
restaurante.pivot_table(index="FechaMes", values="Precio", columns= "Tipo",aggfunc="sum")

Tipo      Bebida  Comida
FechaMes
2014-02    48333  110538
2014-03    66787  132963
2014-04    76557  128915
2014-05    56949  103567
2014-06    69512  120741
2014-07    66772  116047
2014-08    65030  111154
2014-09    42485  112792
2014-10    51808  114414
2014-11    38438  113443
2014-12    41006  120000
2015-01    35197  108181

Graficaremos el ingreso mensual de cada tipo de alimento:

![Resuelto](../Img_Proyecto_Final/Act3Img1.png)

__Conclusión:__ los clientes piden cada vez menos bebidas, pero la comida se mantiene, por lo que tenemos fuertes indicios que el problema general se da en esa área.

### Ejercicio 4:

Analizaremos el ingreso mensual de las bebidas teniendo una columna por categoría:

In [7]:
bebidas=restaurante.loc[restaurante.Tipo=="Bebida"]

In [8]:
bebidas.pivot_table(index="FechaMes", values="Precio", columns= "Categoria",   aggfunc="sum")

Categoria  Bebida no Alcohol  Cervezas  Vinos
FechaMes
2014-02                15377     16145  16811
2014-03                17644     18415  30728
2014-04                16298     17170  43089
2014-05                14994     13480  28475
2014-06                16468     16360  36684
2014-07                15952     15095  35725
2014-08                15135     15155  34740
2014-09                16578     15640  10267
2014-10                16862     15590  19356
2014-11                16578     16665   5195
2014-12                16884     16970   7152
2015-01                15710     14910   4577

Haremos una gráfica de calor sobre los ingresos mensuales de cada tipo de bebida:

![Resuelto](../Img_Proyecto_Final/Act4Img1.png)

Graficaremos el ingreso mensual de cada tipo de bebida:

![Resuelto](../Img_Proyecto_Final/Act4Img2.png)

__Conclusión:__ Los ingresos provenientes de los vinos bajaron mucho, debemos indagar en los posibles motivos, por ejemplo, analizando a los meseros que lo sirven.

### Ejercicio 5:

Obtendremos las ventas mensuales de cada mesero:

In [9]:
ventas_meseros=pd.pivot_table(restaurante, index="FechaMes", values="Precio", aggfunc="sum" ,columns="Atendió", fill_value=0)
ventas_meseros

Atendió,Alejandro,Ernesto,Joel,Mariana,Mauricio,Omar,Rodolfo,Saul,Valentina
FechaMes,,,,,,,,,
2014-02,20750,19666,20447,29480,0,18076,23115,7260,20077
2014-03,24185,25380,29778,19581,0,30387,21735,22947,25757
2014-04,23956,19234,30251,21450,0,32231,34651,26459,17240
2014-05,24446,23593,21257,9166,0,21130,24874,13454,22596
2014-06,32116,31995,18699,29611,0,18446,18263,23672,17451
2014-07,21030,27139,34351,17133,0,11062,15017,33827,23260
2014-08,16371,17814,27550,23007,0,30738,18580,24178,17946
2014-09,17756,14853,10494,14024,30381,20637,18284,14109,14739
2014-10,16555,21821,25249,12674,34959,9201,15056,16795,13912
2014-11,19786,12258,11442,17772,29455,13314,17818,15374,14662
2014-12,17254,24581,12989,17662,31190,18235,15438,11084,12573
2015-01,10229,14302,11339,14542,36568,18624,6713,17862,13199

Haremos una gráfica de calor sobre las ventas de cada mesero:

![Resuelto](../Img_Proyecto_Final/Act5Img1.png)

Graficaremos el ingreso por mes de cada mesero:

![Resuelto](../Img_Proyecto_Final/Act5Img2.png)

__Conclusión:__ las ventas de los meseros al igual que el vino están bajando, excepto por Mauricio que entró a trabajar en septiembre, un buen paso será graficar la relación de estas 2 variables, por ejemplo, calcular cuanto vino vende cada mesero

### Ejercicio 6:

Averiguaremos cuanto vino vende cada mesero:

In [10]:
ventas_vinos=bebidas.loc[bebidas.Categoria=="Vinos"]

In [11]:
vinos_mesero=ventas_vinos.pivot_table(index="Atendió", values="Precio", aggfunc="sum")
vinos_mesero

           Precio
Atendió
Alejandro   45957
Ernesto     38776
Joel        43333
Mariana     25250
Omar        31078
Rodolfo     26233
Saul        35019
Valentina   27153

In [12]:
bebidas.Atendió.unique()

array(['Rodolfo', 'Mauricio', 'Joel', 'Valentina', 'Omar', 'Saul',
       'Alejandro', 'Mariana', 'Ernesto'], dtype=object)

Ordenaremos estos resultados

In [13]:
vinos_mesero.sort_values("Precio")

           Precio
Atendió
Mariana     25250
Rodolfo     26233
Valentina   27153
Omar        31078
Saul        35019
Ernesto     38776
Joel        43333
Alejandro   45957

Hacemos un análisis exploratorio con una gráfica de calor:

![Resuelto](../Img_Proyecto_Final/Act6Img1.png)

Graficamos la venta de vinos de cada mesero:

![Resuelto](../Img_Proyecto_Final/Act6Img2.png)

__Conclusión:__ en la gráfica anterior notamos que no aparece Mauricio, por lo que el descenso en ingresos puede deberse a esto

### Ejercicio 7:

Para poder conocer si los meseros atienden bien utilizaremos una cantidad derivada, la propina, si reciben buenas propinas es aceptable pensar que es por su buen servicio:

In [14]:
restaurante.groupby("Atendió").agg({"Propina":"mean"})

            Propina
Atendió
Alejandro  0.107915
Ernesto    0.111613
Joel       0.111800
Mariana    0.109825
Mauricio   0.200000
Omar       0.111976
Rodolfo    0.107440
Saul       0.112254
Valentina  0.105980

Haremos un analisis exploratorio de los datos con una gráfica de calor:

![Resuelto](../Img_Proyecto_Final/Act7Img1.png)

Graficamos la propina media de cada mesero:

![Resuelto](../Img_Proyecto_Final/Act7Img2.png)

In [15]:
restaurante

,Orden,Fecha,Hora de Cobro,Mesa,Atendió,Tipo,Producto,Categoria,Precio,Costo,Propina,Tipo de Cliente,FechaMes
0,1,2014-02-01,18:43:12,1,Rodolfo,Bebida,Tecate,Cervezas,25,18.00,0.07,Cliente Nuevo,2014-02
1,1,2014-02-01,18:43:12,1,Rodolfo,Bebida,Tisana,Bebida no Alcohol,25,18.00,0.07,Cliente Nuevo,2014-02
2,1,2014-02-01,18:43:12,1,Rodolfo,Bebida,Café americano,Bebida no Alcohol,18,12.60,0.07,Cliente Nuevo,2014-02
3,1,2014-02-01,18:43:12,1,Rodolfo,Bebida,Te helado,Bebida no Alcohol,25,18.50,0.07,Cliente Nuevo,2014-02
4,1,2014-02-01,18:43:12,1,Rodolfo,Comida,Pera Rostizada,Ensaladas,89,75.65,0.07,Cliente Nuevo,2014-02
...,...,...,...,...,...,...,...,...,...,...,...,...,...
30127,2500,2014-07-17,16:33:36,6,Joel,Comida,Mejillones Horneados,Entradas,75,56.25,0.10,Cliente Nuevo,2014-07
30128,2500,2014-07-17,16:33:36,6,Joel,Comida,Brochetas Hawaiianas,Entradas,74,56.98,0.10,Cliente Nuevo,2014-07
30129,2500,2014-07-17,16:33:36,6,Joel,Comida,Panela a la Leña,Entradas,53,42.40,0.10,Cliente Nuevo,2014-07
30130,2500,2014-07-17,16:33:36,6,Joel,Comida,Vacío,Platos Fuertes,164,132.84,0.10,Cliente Nuevo,2014-07
30131,2500,2014-07-17,16:33:36,6,Joel,Comida,Tacos Capeados,Tacos,75,60.75,0.10,Cliente Nuevo,2014-07

__Conclusión:__ todos los meseros tienen propinas similares, a excepción de Mauricio, por lo que debemos analizar la cantidad de clientes que vuelven a comprar con nosotros, en especial después de septiembre.

### Ejercicio 8:

Analizaremos la cantidad de clientes nuevos contra los que regresan:

In [16]:
restaurante.pivot_table(index="FechaMes", values="Precio", columns="Tipo de Cliente", aggfunc="sum")

Tipo de Cliente  Cliente Nuevo  Cliente Repetido
FechaMes
2014-02                 108372             50499
2014-03                 134946             64804
2014-04                 133901             71571
2014-05                 102307             58209
2014-06                 129283             60970
2014-07                 126675             56144
2014-08                 120012             56172
2014-09                 123245             32032
2014-10                 122539             43683
2014-11                 116545             35336
2014-12                 125679             35327
2015-01                 113467             29911

Haremos una gráfica de calor sobre las ventas al mes por tipo de cliente:

![Resuelto](../Img_Proyecto_Final/Act8Img1.png)

Graficaremos las ventas al mes por tipo de cliente:

![Resuelto](../Img_Proyecto_Final/Act8Img2.png)

__Conclusión:__ los clientes deciden no volver a comer con nosotros, analizaremos el impacto de este hecho en la venta de vino.

### Ejercicio 9:

Analizaremos la venta de vinos según el tipo de cliente:

In [17]:
ventas_vinos.pivot_table(index="FechaMes", values="Precio", columns="Tipo de Cliente", aggfunc="sum")

Tipo de Cliente  Cliente Nuevo  Cliente Repetido
FechaMes
2014-02                   3168             13643
2014-03                   9389             21339
2014-04                  25433             17656
2014-05                   9095             19380
2014-06                  17222             19462
2014-07                  18964             16761
2014-08                  16574             18166
2014-09                   9552               715
2014-10                   8372             10984
2014-11                   4077              1118
2014-12                   6155               997
2015-01                   3159              1418

Haremos una gráfica de calor las ventas de vino al mes por tipo de cliente:

![Resuelto](../Img_Proyecto_Final/Act9Img1.png)

Graficaremos las ventas de vino al mes por tipo de cliente:

![Resuelto](../Img_Proyecto_Final/Act9Img2.png)

__Conclusión:__ la venta de vino en los clientes nuevos se mantuvo, pero en los repetidos ha descendido, en especial desde septiembre, debemos investigar la venta de cada mesero separado por tipo de cliente.

### Ejercicio 10:

Analizar la venta de cada mesero en base al tipo de cliente:

In [18]:
restaurante.pivot_table(index="Atendió", values="Precio", aggfunc="sum", columns="Tipo de Cliente")

Tipo de Cliente  Cliente Nuevo  Cliente Repetido
Atendió
Alejandro             155952.0           88482.0
Ernesto               170101.0           82535.0
Joel                  188364.0           65482.0
Mariana               152285.0           73817.0
Mauricio              162553.0               NaN
Omar                  152538.0           89543.0
Rodolfo               163057.0           66487.0
Saul                  165294.0           61727.0
Valentina             146827.0           66585.0

Para analizar mejor el trato que le dan a los clientes por tipo, transformaremos sus ventas a porcentajes:

In [19]:
porcentajes_meseros=restaurante.pivot_table(index="Atendió", values="Precio", aggfunc="sum", columns="Tipo de Cliente")
porcentajes_meseros.head()

Tipo de Cliente  Cliente Nuevo  Cliente Repetido
Atendió
Alejandro             155952.0           88482.0
Ernesto               170101.0           82535.0
Joel                  188364.0           65482.0
Mariana               152285.0           73817.0
Mauricio              162553.0               NaN

In [20]:
porcentajes_meseros["Total"]=porcentajes_meseros["Cliente Nuevo"]+porcentajes_meseros["Cliente Repetido"]
porcentajes_meseros["Pocentaje Nuevo"]=porcentajes_meseros["Cliente Nuevo"]/porcentajes_meseros["Total"]
porcentajes_meseros["Pocentaje Repetido"]=porcentajes_meseros["Cliente Repetido"]/porcentajes_meseros["Total"]
porcentajes_meseros

Tipo de Cliente,Cliente Nuevo,Cliente Repetido,Total,Pocentaje Nuevo,Pocentaje Repetido
Atendió,,,,,
Alejandro,155952.0,88482.0,244434.0,0.638013,0.361987
Ernesto,170101.0,82535.0,252636.0,0.673305,0.326695
Joel,188364.0,65482.0,253846.0,0.742040,0.257960
Mariana,152285.0,73817.0,226102.0,0.673523,0.326477
Mauricio,162553.0,NaN,NaN,NaN,NaN
Omar,152538.0,89543.0,242081.0,0.630111,0.369889
Rodolfo,163057.0,66487.0,229544.0,0.710352,0.289648
Saul,165294.0,61727.0,227021.0,0.728100,0.271900
Valentina,146827.0,66585.0,213412.0,0.687998,0.312002

Haremos un análisis exploratorio de los datos con un mapa de calor:

![Resuelto](../Img_Proyecto_Final/Act10Img1.png)

Y finalmente graficaremos las ventas al mes de cada mesero por tipo de cliente:

![Resuelto](../Img_Proyecto_Final/Act10Img2.png)

__Conclusión:__ Mauricio no atiende clientes repetidos.

__Conlusión General:__ Los clientes repetidos son los que más vino consumían, al dejar de regresar nuestros ingresos disminuyeron, nuestro principal sospechoso es Mauricio por tener unas propinas anormalmente altas, pero pese a ello los clientes no quieren volver a ser atendidos por el.

Tras hacer una investigación presencial encontramos que la manera en la que Mauricio atendía era grosera y exigia a los comensales consumir más y cargaba propina sin avisar, por eso sus ventas eran altas, pero ahuyentaba a los clientes.